Autodesk.Revit.DB.OrdinateDimensionSetting.OriginTickMarkId
dimension origin tick mark ID
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateDimensionSetting.OriginVisibility
dimension ordinate origin visibility
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateDimensionSetting.TextPosition
dimension text position
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateDimensionSetting.TextOrientation
dimension text orientation
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateDimensionSetting.DimensionLineStyle
dimension line style
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateDimensionSetting.DimensionLineLength
dimension line length
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for dimensionLineLength must be greater than 0 and no more than 30000 feet.
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateDimensionSetting
this class is used for dimension ordinate setting
Remarks:
Dimension ordinate settting class
Since:
2017 Subscription Update